Repository: Jefferson49/webtrees-oauth2-client
Catalog: resources/lang/*.po
Languages: nl

source: The configuration for the authorization provider "%s" does not include data for the option "%s". Please check the configuration in the following file: data/config.ini.php
nl: De configuratie voor de autorisatieprovider “%s” bevat geen gegevens voor de optie “%s”. Controleer de configuratie in het volgende bestand: data/config.ini.php

source: The requested authorization provider could not be found
nl: De aangevraagde autorisatieprovider kon niet worden gevonden

source: Disconnected the user %s from provider: %s
nl: De koppeling tussen gebruiker %s en autorisatieleverancier %s is verbroken

source: Failed security check: A user, who is currently not signed in, requested to connect an authorization provider with the current user.
nl: Beveiligingscontrole mislukt: Een gebruiker die momenteel niet is aangemeld, heeft gevraagd om een autorisatieprovider te verbinden met de huidige gebruiker.

source: Timeout for connecting user %s with authorization provider %s. Please restart connecting with the authorization provider.
nl: Time-out voor verbinding van gebruiker %s met autorisatieprovider %s. Start de verbinding met de autorisatieprovider opnieuw.

source: OAuth 2.0 communication error
nl: OAuth 2.0-communicatiefout

source: Invalid state in communication with authorization provider.
nl: Ongeldige status in communicatie met autorisatieprovider.

source: Failed to get the access token or the user details from the authorization provider
nl: Het toegangstoken of de gebruikersgegevens zijn niet verkregen van de autorisatieprovider

source: The identity received by the authorization provider cannot be connected to the requested user, because it is already used to sign in by another webtrees user.
nl: De identiteit die de autorisatieprovider ontvangt, kan niet worden gekoppeld aan de aangevraagde gebruiker, omdat deze al wordt gebruikt om in te loggen door een andere webtrees-gebruiker.

source: Sucessfully connected existing user %s with provider: %s
nl: Bestaande gebruiker %s succesvol verbonden met provider: %s

source: Currently, no webtrees user account is related to the user data received from the authorization provider.
nl: Op dit moment is er geen webtrees-gebruikersaccount gekoppeld aan de gebruikersgegevens die zijn ontvangen van de autorisatieprovider.

source: It is not possible to request a webtrees account with %s.
nl: Het is niet mogelijk om een webtrees-account aan te vragen met %s.

source: To connect an existing user with %s, sign in and select: My pages / My account / Connect with
nl: Als u een bestaande gebruiker met %s wilt verbinden, meldt u zich aan en selecteert u: Mijn pagina's / Mijn account / Verbinden met

source: Invalid user data received from %s. Email or username missing.
nl: Ongeldige gebruikersgegevens ontvangen van %s. E-mail of gebruikersnaam ontbreekt.

source: Requesting a new webtrees user account is currently not allowed.
nl: Het aanvragen van een nieuw webtrees-gebruikersaccount is momenteel niet toegestaan.

source: Press "continue" to request a new webtrees user acccount with %s.
nl: Druk op “doorgaan” om een nieuw webtrees-gebruikersaccount aan te vragen met %s.

source: Request a new user account with an authorization provider
nl: Een nieuwe gebruikersaccount aanvragen bij een autorisatieprovider

source: The email address for user %s was updated to: %s
nl: Het e-mailadres voor gebruiker %s is bijgewerkt naar: %s

source: Login denied. The email address or username already exists.
nl: Inloggen geweigerd. Het e-mailadres of de gebruikersnaam bestaat al.

source: A custom module to implement a OAuth2 client for webtrees.
nl: Een aangepaste module om een OAuth2-client voor webtrees te implementeren.

source: Sign in with
nl: Aanmelden met

source: Disconnect account from
nl: Verbreek verbinding van account met

source: Connect account with
nl: Verbind account met

source: The preferences for the module "%s" were updated.
nl: De voorkeuren voor de module “%s” zijn bijgewerkt.

source: The redirect URL for OAuth 2.0 communication has changed in custom module versions >= 1.1.0. If certain connections with authorization providers fail, you might need to update the authorization provider settings with the new redirect URL.
nl: De omleidings-URL voor OAuth 2.0-communicatie is gewijzigd in aangepastemoduleversies >= 1.1.0. Als bepaalde verbindingen met autorisatieproviders mislukken, moet u mogelijk de instellingen van de autorisatieprovider bijwerken met de nieuwe omleidings-URL.

source: The preferences for the custom module "%s" were sucessfully updated to the new module version %s.
nl: De voorkeuren voor de aangepaste module “%s” zijn bijgewerkt naar de nieuwe moduleversie %s.

source: The custom module "%s" is activated in parallel to the %s custom module. This can lead to unintended behavior. If using the %s module, it is strongly recommended to deactivate the "%s" module, because the identical functionality is also integrated in the %s module.
nl: De aangepaste module “%s” is parallel aan de aangepaste module %s geactiveerd. Dit kan leiden tot onbedoeld gedrag. Als u de module %s gebruikt, is het sterk aan te raden om de module “%s” te deactiveren, omdat de identieke functionaliteit ook in de module %s is geïntegreerd.

source: The custom module "%s" is activated in parallel to the %s custom module. This can lead to unintended behavior, because both of the modules have registered the same custom view "%s". It is strongly recommended to deactivate one of the modules.
nl: De aangepaste module “%s” is parallel aan de aangepaste module %s geactiveerd. Dit kan leiden tot onbedoeld gedrag, omdat beide modules dezelfde aangepaste weergave “%s” hebben geregistreerd. Het wordt sterk aangeraden om een van de modules te deactiveren.

source: The custom module view "%s" is not registered as replacement for the standard webtrees view. There might be another module installed, which registered the same custom view. This can lead to unintended behavior. It is strongly recommended to deactivate one of the modules. The path of the parallel view is: %s
nl: De aangepaste moduleweergave “%s” is niet geregistreerd als vervanging voor de standaard webtrees-weergave. Er kan een andere module geïnstalleerd zijn die dezelfde aangepaste weergave heeft geregistreerd. Dit kan leiden tot onbedoeld gedrag. Het wordt sterk aangeraden om een van de modules te deactiveren. Het pad van de parallelle weergave is: %s

source: Error while trying to get an access token from the authorization provider. Check the setting for urlAccessToken in the webtrees configuration. Check the server access logs (or .htaccess configuration files) whether any 301 or 302 redirects are applied, which might convert POST into GET requests.
nl: Fout bij het verkrijgen van een toegangstoken van de autorisatieprovider. Controleer de instelling voor urlAccessToken in de webtrees-configuratie. Controleer de toegangslogboeken van de server (of de .htaccess-configuratiebestanden) of er 301- of 302-omleidingen worden toegepast, waardoor POST-verzoeken mogelijk worden omgezet in GET-verzoeken.

source: Invalid user data received from the authorization provider
nl: Ongeldige gebruikersgegevens ontvangen van de autorisatieprovider

source: Check the setting for urlResourceOwnerDetails in the webtrees configuration.
nl: Controleer de instelling voor urlResourceOwnerDetails in de webtrees-configuratie.

source: Automatic user registration after sign in with authorization provider
nl: Automatische gebruikersregistratie na aanmelding bij autorisatieprovider

source: Custom module
nl: Aangepaste module

source: The authorization provider "%s" is not available. Please contact the webtrees administrator.
nl: De autorisatie provider “%s” is niet beschikbaar. Neem contact op met de webtrees-beheerder.

source: Signed in with %s
nl: Aangemeld met %s

source: This user can sign in with %s
nl: Deze gebruiker kan zich aanmelden met %s

source: The administrator might have disabled to change the email address or the password
nl: De beheerder heeft mogelijk uitgeschakeld om het e-mailadres of wachtwoord te wijzigen

source: Request a new user account with
nl: Vraag een nieuw gebruikersaccount aan met

source: Connect with
nl: Verbinden met

source: Disconnect from
nl: Verbinding verbreken met

source: Sign in with an authorization provider
nl: Aanmelden met een autorisatieprovider

source: In this view, you can only request a webtrees password. The authorization provider password is managed by the authorization provider and cannot be changed within webtrees.
nl: In deze weergave kunt u alleen een webtrees-wachtwoord opvragen. Het wachtwoord van de autorisatieprovider wordt beheerd door de autorisatieprovider en kan niet worden gewijzigd binnen webtrees.

source: The request to reset the passwort belongs to a user, who can sign in with an authorization provider. In this view, you can only change the webtrees password. The authorization provider password is managed by the authorization provider and cannot be changed within webtrees.
nl: Het verzoek om het wachtwoord opnieuw in te stellen hoort bij een gebruiker die zich kan aanmelden met een autorisatieprovider. In deze weergave kunt u alleen het wachtwoord van webtrees wijzigen. Het wachtwoord van de autorisatieprovider wordt beheerd door de autorisatieprovider en kan niet worden gewijzigd binnen webtrees.

source: Currently, the webtrees password cannot be reset for users, who sign in with an authorization provider. Please contact the webtrees administrator.
nl: Op dit moment kan het wachtwoord van webtrees niet gereset worden voor gebruikers die zich aanmelden met een autorisatieprovider. Neem contact op met de webtrees-beheerder.

source: Request account with
nl: Account aanvragen bij

source: The administrator might have disabled to change some of the received user data
nl: De beheerder heeft mogelijk uitgeschakeld om sommige ontvangen gebruikersgegevens te wijzigen

source: Password (within webtrees)
nl: Wachtwoord (binnen webtrees)

source: Further registration data - Please complete and continue
nl: Verdere registratiegegevens - Vul in en ga verder

source: Request a new account with
nl: Vraag een nieuw account aan bij

source: Control panel
nl: Controlepaneel

source: Currently, webtrees does not use the HTTPS protocol. If signing in with authorization providers, it is urgently recommended to use HTTPS in order to encrypt the communication with the authorization provider. If your server supports the protocol, HTTPS can be activated by changing "base_url" in the webtrees "config.ini.php" file. Currently, "base_url" does not start with "https://".
nl: Momenteel gebruikt webtrees het HTTPS-protocol niet. Als u zich aanmeldt bij autorisatieproviders, wordt het dringend aanbevolen om HTTPS te gebruiken om de communicatie met de autorisatieprovider te versleutelen. Als uw server het protocol ondersteunt, kan HTTPS geactiveerd worden door “base_url” te veranderen in het webtrees “config.ini.php” bestand. Op dit moment begint “base_url” niet met “https://”.

source: Settings for Sign In Menus
nl: Instellingen voor aanmeldmenu's

source: Currently, all menus to directly sign in with webtrees are deactivated. Therefore, only sign in with authorization providers is possible. Please be sure that you establish a webtrees administrator account with an authorization provider. Otherwise, administrator sign in is not possible any more. Hint: You can still access the original webtrees login page by typing the login route into the browser line, e.g.:
nl: Op dit moment zijn alle menu's om direct in te loggen met webtrees uitgeschakeld. Daarom is alleen aanmelden met autorisatieproviders mogelijk. Zorg ervoor dat u een webtrees-beheerdersaccount aanmaakt bij een autorisatieprovider. Anders is aanmelden als beheerder niet meer mogelijk. Tip: U kunt nog steeds de originele webtrees-aanmeldpagina openen door de aanmeldroute in de browserregel te typen, bijv:

source: Currently, the webtrees sign in menu is deactivated and the custom module sign in menu is hidden for the following trees: %s. Some of the users will not be able to sign in. Please consider to activate one of the sign in menus with the settings below.
nl: Op dit moment is het aanmeldmenu van webtrees gedeactiveerd en is het aanmeldmenu van de aangepaste module verborgen voor de volgende stambomen: %s. Sommige gebruikers kunnen zich niet aanmelden. Overweeg om een van de aanmeldmenu's te activeren met de onderstaande instellingen.

source: Show original webtrees sign in as menu item
nl: Toon menu-item voor het originele webtrees-aanmeldmenu

source: By selecting/unselecting this option, it is possible to activate/deactivate the sign in menu entry for webtrees. If deactivated, only sign in menu entries for authorization providers might be shown.
nl: Door deze optie te selecteren/deactiveren, is het mogelijk om de aanmeldmenuoptie voor webtrees te activeren/deactiveren. Als deze optie is uitgeschakeld, worden mogelijk alleen aanmeldmenu's voor autorisatieproviders weergegeven.

source: Hide the webtrees sign in menu
nl: Verberg het aanmeldmenu van webtrees

source: Hide
nl: Verberg

source: By selecting this option, it is possible to hide the original webtrees sign in menu. This might be helpful if the custom module specific top menu for sign in is used instead.
nl: Door deze optie te selecteren, is het mogelijk om het originele webtrees-aanmeldmenu te verbergen. Dit kan handig zijn als in plaats daarvan het aangepaste modulespecifieke bovenste menu voor aanmelden wordt gebruikt.

source: Settings for Password, Email, and Connection Management
nl: Instellingen voor wachtwoord-, e-mail- en verbindingsbeheer

source: Keep email address synchronized with authorization provider
nl: Houd e-mailadres gesynchroniseerd met autorisatieprovider

source: Keep synchronized
nl: Gesynchroniseerd houden

source: This selection prevents a user with the same email address in webtrees and at the authorization provider from changing the email address in webtrees. If the email address at the authorization provider changes, the email address in webtrees will be updated during sign in. If the administrator changes the email address in the webtrees user management, the email address synchronization will no longer continue.
nl: Deze selectie voorkomt dat een gebruiker met hetzelfde e-mailadres in webtrees en bij de autorisatieprovider het e-mailadres in webtrees verandert. Als het e-mailadres bij de autorisatieprovider verandert, wordt het e-mailadres in webtrees bijgewerkt tijdens het aanmelden. Als de beheerder het e-mailadres in het gebruikersbeheer van webtrees wijzigt, wordt de synchronisatie van het e-mailadres niet langer voortgezet.

source: Use webtrees password in parallel
nl: Gebruik webtrees-wachtwoord parallel

source: This option allows users, who register with an authorization provider, to additionally sign in with a webtrees password.
nl: Met deze optie kunnen gebruikers, die zich registreren bij een autorisatieprovider, zich ook aanmelden met een webtrees-wachtwoord.

source: Allow existing webtrees users to connect with an authorization provider
nl: Bestaande webtrees-gebruikers toestaan om verbinding te maken met een autorisatieprovider

source: If selecting this option, an existing webtrees user can connect the webtrees account with an authorization provider. This will allow users to additionally sign in with an authorization providers while still using the webtrees user and password.
nl: Als u deze optie selecteert, kan een bestaande webtrees-gebruiker het webtrees-account verbinden met een autorisatieprovider. Hierdoor kunnen gebruikers zich extra aanmelden met een autorisatieprovider terwijl ze nog steeds de webtrees-gebruiker en het wachtwoord gebruiken.

source: Debug Settings
nl: Debug-instellingen

source: Debug logs
nl: Debug-logboeken

source: By selecting this option, additional debug information about the protocol flow between webtrees and the authorization provider will be logged in the webtrees website logs.
nl: Door deze optie te selecteren wordt extra debug-informatie over de protocolstroom tussen webtrees en de autorisatieprovider gelogd in de webtrees-websitelogboeken.
